QA = {
    "general-question": "대한 언급이 있습니까?",
    "관광_경치 좋은": {
        "description": "사용자는 경치가 좋은 관광지를 원합니까?",
    },
    "관광_교육적": {
        "description": "사용자는 교육적인 관광지를 원합니까?",
    },
    "관광_도보 가능": {
        "description": "사용자는 도보가 가능한 관광지를 원합니까?",
    },
    "관광_문화 예술": {
        "description": "사용자는 문화 예술적인 관광지를 원합니까?"
    },
    "관광_역사적": {
        "description": "사용자는 역사적인 관광지를 원합니까?",
    },
    "관광_이름": {
        "description": "사용자가 원하는 관광지의 이름은 무엇입니까?"
    },
    "관광_종류": {
        "description": "사용자가 원하는 관광지의 종류는 무엇입니까?"
    },
    "관광_주차 가능": {
        "description": "사용자는 주차가 가능한 관광지를 원합니까?",
    },
    "관광_지역": {
        "description": "사용자가 원하는 관광지의 지역은 어디입니까?",
    },
    "숙소_가격대": {
        "description": "사용자가 원하는 숙소의 가격대는 어느정도 입니까?"
    },
    "숙소_도보 가능": {
        "description": "사용자는 도보가 가능한 숙소를 원합니까?",
    },
    "숙소_수영장 유무": {
        "description": "사용자는 수영장이 있는 숙소를 원합니까?"
    },
    "숙소_스파 유무": {
        "description": "사용자는 스파가 있는 숙소를 원합니까?"
    },
    "숙소_예약 기간": {
        "description": "사용자가 원하는 숙소 예약 기간은 몇 일 입니까?"
    },
    "숙소_예약 명수": {
        "description": "사용자가 원하는 숙소 예약 인원은 몇 명입니까?"
    },
    "숙소_예약 요일": {
        "description": "사용자는 무슨 요일에 숙소를 예약하길 원합니까?"
    },
    "숙소_이름": {
        "description": "사용자가 원하는 숙소 이름은 무엇입니까?"
    },
    "숙소_인터넷 가능": {
        "description": "숙소는 인터넷이 가능해야 합니까?",
    },
    "숙소_조식 가능": {
        "description": "숙소는 조식이 가능해야 합니까?"
    },
    "숙소_종류": {
        "description": "사용자가 원하는 숙소의 종류는 무엇입니까?"
    },
    "숙소_주차 가능": {
        "description": "사용자는 주차가 가능한 숙소를 원합니까?"
    },
    "숙소_지역": {
        "description": "사용자가 원하는 숙소의 지역은 어디입니까?"
    },
    "숙소_헬스장 유무": {
        "description": "숙소에는 헬스장이 있어야 합니까?"
    },
    "숙소_흡연 가능": {
        "description": "숙소는 흡연이 가능해야 합니까?"
    },
    "식당_가격대": {
        "description": "사용자가 원하는 식당의 가격대는 어느정도 입니까?"
    },
    "식당_도보 가능": {
        "description": "사용자는 도보가 가능한 식당을 원합니까?",
    },
    "식당_야외석 유무": {
        "description": "식당에는 야외석이 있어야 합니까?"
    },
    "식당_예약 명수": {
        "description": "사용자가 원하는 식당 예약 인원은 몇 명입니까?"
    },
    "식당_예약 시간": {
        "description": "사용자가 원하는 식당 예약 시간은 언제입니까?"
    },
    "식당_예약 요일": {
        "description": "사용자는 무슨 요일에 식당을 예약하길 원합니까?"
    },
    "식당_이름": {
        "description": "사용자가 원하는 식당의 이름은 무엇입니까?"
    },
    "식당_인터넷 가능": {
        "description": "식당은 인터넷이 가능해야 합니까?",
    },

    "식당_종류": {
        "description": "사용자가 원하는 식당의 종류는 무엇입니까?"
    },
    "식당_주류 판매":{
        "description" : "식당은 주류를 판매해야 합니까?"
    },
    "식당_주차 가능" : {
        "description" : "사용자는 주차가 가능한 식당을 원합니까?"
    },
    "식당_지역": {
        "description": "사용자가 원하는 식당의 지역은 어디입니까?"
    },
    "식당_흡연 가능": {
        "description": "식당은 흡연이 가능해야 합니까?"
    },
    "지하철_도착지": {
        "description": "사용자의 지하철 도착지는 어디입니까?"
    },
    "지하철_출발 시간": {
        "description": "사용자의 지하철 출발 시간은 언제입니까?"
    },
    "지하철_출발지": {
        "description": "사용자의 지하철 출발지는 어디입니까?"
    },
    "택시_도착 시간": {
        "description": "사용자의 택시 도착 시간은 언제 입니까?"
    },
    "택시_도착지": {
        "description": "사용자의 택시 도착지는 어디입니까?"
    },
    "택시_종류":{
        "description" : "사용자가 원하는 택시 종류는 무엇입니까?"
    },
    "택시_출발 시간": {
        "description": "사용자의 택시 출발 시간은 언제입니까?"
        
    },
    "택시_출발지": {
        "description": "사용자의 택시 출발지는 어디입니까?"
    },
    "all-domain" : [
        "관광_경치 좋은",
        "관광_교육적",
        "관광_도보 가능",
        "관광_문화 예술",
        "관광_역사적",
        "관광_이름",
        "관광_종류",
        "관광_주차 가능",
        "관광_지역",
        "숙소_가격대",
        "숙소_도보 가능",
        "숙소_수영장 유무",
        "숙소_스파 유무",
        "숙소_예약 기간",
        "숙소_예약 명수",
        "숙소_예약 요일",
        "숙소_이름",
        "숙소_인터넷 가능",
        "숙소_조식 가능",
        "숙소_종류",
        "숙소_주차 가능",
        "숙소_지역",
        "숙소_헬스장 유무",
        "숙소_흡연 가능",
        "식당_가격대",
        "식당_도보 가능",
        "식당_야외석 유무",
        "식당_예약 명수",
        "식당_예약 시간",
        "식당_예약 요일",
        "식당_이름",
        "식당_인터넷 가능",
        "식당_종류",
        "식당_주류 판매",
        "식당_주차 가능",
        "식당_지역",
        "식당_흡연 가능",
        "지하철_도착지",
        "지하철_출발 시간",
        "지하철_출발지",
        "택시_도착 시간",
        "택시_도착지",
        "택시_종류",
        "택시_출발 시간",
        "택시_출발지",
    ],
    
    'bigger-domain' : [
        '관광',
        '숙소',
        '식당',
        '지하철',
        '택시'
    ],
    "NOT_MENTIONED" : '언급 없음',
}





